{
  "backend/main.mo": "Actor handling user profiles with authorization and storing inquiries, including submission by guests and admin-only retrieval.",
  "feature_evidence.json": "Feature evidence listing features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing short descriptions of various frontend source files.",
  "frontend/index.css": "Tailwind base styles defining color variables, radii, and dark mode overrides.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root component performing hash-based routing between marketing and admin pages.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with loading states and error fallback.",
  "frontend/src/components/Inquiry/InquiryForm.tsx": "Validated inquiry submission form with state management, field validation, and success handling.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout component with header navigation, scroll helpers, optional admin link, and footer.",
  "frontend/src/components/Marketing/InsuranceSection.tsx": "Component rendering a detailed insurance info section with icons, coverage, target audience, and preparation info.",
  "frontend/src/components/Marketing/PartnersSection.tsx": "Displays insurance partner companies in a responsive grid layout.",
  "frontend/src/content/insuranceContent.ts": "Defines insurance type interface and static data describing various insurance products.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAdminStatus.ts": "Checks whether the authenticated user is an admin using the backend actor.",
  "frontend/src/hooks/useInquiries.ts": "Fetches, filters, and manages selection of inquiries from the backend.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading, login, and logout handling.",
  "frontend/src/hooks/useSubmitInquiry.ts": "Hook to submit a new inquiry through the backend actor with loading and error state.",
  "frontend/src/index.css": "Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/lib/validation.ts": "Field-level validation utilities for form inputs such as name, phone, and message.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, and identity provider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page handling auth states, showing login or access denied screens, and rendering inquiry management for admins.",
  "frontend/src/pages/MarketingPage.tsx": "Marketing landing page with hero, services, partners, and inquiry form sections, using scroll-based navigation.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and layout settings for the project theme.",
  "project_state.json": "Project state file describing version, goals, features, requirements, and image assets for the insurance website."
}